Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ПопыткаВыполненияПодборкиВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияПодборкиВопросовСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>DefinedType.ВариантЗаданияЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подборка</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <comment>Отведенное на выполнение время теста</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБалловПсихологическихВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическийВопрос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесВопроса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементПодборкиИзРубрикатора</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиИзРубрикатораСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПодборки</name>
    <comment>Сохраняются группы подборки (элементы подборки верхнего уровня, которые образует ее страницы), которые были на момент начала сессии теста. В ссылках параметр numGroup</comment>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеВопросыОтвечены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВопросыНаПроверку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПрохождениеОбученияСУО/Forms/ФормаРезультатыТестирования/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Параметры.ПрохождениеОбучения)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		
		Текст = НСтр("ru = 'Не заданы параметры формы'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		
		Возврат;
		
	КонецЕсли;
	
	// Получаем данные
	
	ДанныеПрохожденияМероприятия   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПрохождениеОбучения, "Сценарий, Пользователь, ПроведениеОбучения");
	ТекущийПользовательМероприятия = ДанныеПрохожденияМероприятия.Пользователь;
	
	Если ЗначениеЗаполнено(Параметры.Задание) Тогда
		
		Задание = Параметры.Задание;
		
	Иначе
		
		
		ОписаниеМероприятияСОднимЭлектроннымЗаданием = УправлениеОбучениемСУОПовтИсп.ОписаниеЕдинственногоЗаданияСценария(ДанныеПрохожденияМероприятия.Сценарий, ДанныеПрохожденияМероприятия.ПроведениеОбучения);
		
		Если ОписаниеМероприятияСОднимЭлектроннымЗаданием = Неопределено Тогда
			Задание = Неопределено;
		Иначе
			Задание = ОписаниеМероприятияСОднимЭлектроннымЗаданием.Задание;
		КонецЕсли;
			
	КонецЕсли;
	
	// Заполняем список сессий
	
	Результат = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СессииТестирования(Параметры.Пользователь, Параметры.ПрохождениеОбучения, Задание);
	
	Если Результат.Пустой() Тогда
		Текст = НСтр("ru = 'Результаты тестирования не найдены'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СписокСессий = Элементы.СессияТестирования.СписокВыбора;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокСессий.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ПолучитьПредставлениеСессии(ВыборкаДетальныеЗаписи));  
	КонецЦикла;
	
	СессияТестирования  = ВыборкаДетальныеЗаписи.Ссылка;
	
	УстановитьПараметрыТаблицыРезультатов();
	
	// Устанавливаем видимость элементов
	
	ЕстьПравоПросмотраСессииТестирования = ОбучениеСУОПовтИсп.ЕстьПравоПросматриватьВыполненныеЗадания();
	
	Если НЕ ЕстьПравоПросмотраСессииТестирования Тогда
		Элементы.ОткрытьТест.Видимость = Ложь;
		Элементы.РезультатыВопрос.Гиперссылка = Ложь;
		Элементы.РезультатыВопрос.ГиперссылкаЯчейки = Ложь;
		Элементы.РезультатыВопрос.Шрифт = Новый Шрифт();
		Элементы.РезультатыВопрос.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПрохождениеОбучения"
		И Параметр = Параметры.ПрохождениеОбучения Тогда
		
		ОбновитьСписокСессийТестирования();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СессияТестированияПриИзменении(Элемент)
	УстановитьПараметрыТаблицыРезультатов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультаты

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Результаты

&НаКлиенте
Процедура РезультатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЕстьПравоПросмотраСессииТестирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	НастройкиТестирования = ПолучитьНастройкиТестирования(СессияТестирования, ТекущиеДанные.НомерСтраницы);
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
										 НастройкиТестирования.СсылкаНаЭлемент,
										 Истина,
										 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
										 Параметры.ПрохождениеОбучения,
										 ?(ЗначениеЗаполнено(Задание), Задание, НастройкиТестирования.СводЗнаний),
	                                     ,
	                                     ,
	                                     Истина,
	                                     ?(Параметры.ОткрытоВнешнимПользователем, ТекущийПользовательМероприятия, Неопределено));
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьТест(Команда)
	
	Если ЕстьПравоПросмотраСессииТестирования Тогда
		
		НастройкиТестирования = ПолучитьНастройкиТестирования(СессияТестирования);
		
		ОбъектыСУЗКлиент.ОткрытьОбозреватель(НастройкиТестирования.СводЗнаний,
											 НастройкиТестирования.СсылкаНаЭлемент,
											 Истина,
											 НастройкиТестирования.ЭлементСодержанияСводаЗнаний,
											 Параметры.ПрохождениеОбучения,
											 ?(ЗначениеЗаполнено(Задание), Задание, НастройкиТестирования.СводЗнаний),
	                                         ,
	                                         ,
	                                         Истина,
	                                         ?(Параметры.ОткрытоВнешнимПользователем, ТекущийПользовательМероприятия, Неопределено));
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьНастройкиТестирования(СессияВыполненияТеста, НомерГруппыПодборки=Неопределено)
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ДанныеТестированияДляПросмотра(СессияВыполненияТеста, НомерГруппыПодборки);
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеСессии(ДанныеСессии)
	
	ПредставлениеСессии = НСтр("ru = '%3 - Попытка от %1 - %2 баллов'");
	ПредставлениеСессии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеСессии, Формат(ДанныеСессии.Дата), ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ДанныеСессии.ИтоговыйРезультат), ДанныеСессии.Наименование);
	
	Возврат ПредставлениеСессии;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокСессийТестирования()
	
	СписокСессий = Элементы.СессияТестирования.СписокВыбора;
	
	Результат = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СессииТестирования(Параметры.Пользователь, Параметры.ПрохождениеОбучения, Задание);
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаСписка = СписокСессий.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка);
		
		Если СтрокаСписка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСписка.Представление = ПолучитьПредставлениеСессии(ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	Элементы.Результаты.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуВесовВопросов(СессияТестирования)
	
	Вопросы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СессияТестирования, "Вопросы").Выгрузить();
	
	Возврат Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.СуммаВесовВопросов(Вопросы);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыТаблицыРезультатов()
	
	Результаты.Параметры.УстановитьЗначениеПараметра("СессияВыполненияТеста", СессияТестирования);
	Результаты.Параметры.УстановитьЗначениеПараметра("СуммаВсехВесов", ПолучитьСуммуВесовВопросов(СессияТестирования));
	
	Тест                       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СессияТестирования, "Подборка");
	ПоказыватьСтоимостьВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тест, "ПоказыватьСтоимостьВопроса");
	
	Если ПоказыватьСтоимостьВопроса Тогда
		Элементы.СтоимостьВопроса.Видимость    = Истина;		
		Элементы.НабраноБаллов.Видимость       = Истина;
		Элементы.РезультатыРезультат.Видимость = Ложь;
		Элементы.ВесВопроса.Видимость          = Ложь;
	Иначе
		Элементы.СтоимостьВопроса.Видимость    = Ложь;		
		Элементы.НабраноБаллов.Видимость       = Ложь;
		Элементы.РезультатыРезультат.Видимость = Истина;
		Элементы.ВесВопроса.Видимость          = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
